Public Attributes | List of all members
API_AddonObject Struct Reference
Add-On Objects
Control information of a custom data stored into the project database. More...
#include <APIdefs_Callback.h>
 Public Attributes
API_Guid  | id
The GUID of the AddOnObject.
GS::UniString *  | name
The name of the AddOnObject.
GSHandle  | data
User specified data (cannot be nullptr).
API_AddonObjectType  | type
Whether the AddOnObject is general (non-unique) or unique.
Detailed Description
Control information of a custom data stored into the project database.
Remarks
This structure is used by the AddOnObject Manager functions, for further details refer to these sections.
Member Data Documentation
◆ data
 API_AddonObject::data
User specified data (cannot be nullptr).
◆ id
 API_AddonObject::id
The GUID of the AddOnObject.
◆ name
 API_AddonObject::name
The name of the AddOnObject.
◆ type
 API_AddonObject::type
Whether the AddOnObject is general (non-unique) or unique.